DebtManagment/src/Documents/СменаСтатусаРаботыСДолгами/СменаСтатусаРаботыСДолгами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаСтатусаРаботыСДолгами</name>
  <registerRecords>InformationRegister.СтатусыРаботыСДолгом</registerRecords>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСтатусРаботыСДолгом</name>
      <type>
        <types>EnumRef.СтатусыРаботыСДолгом</types>
      </type>
    </attributes>
    <attributes>
      <name>Реестр</name>
      <type>
        <types>DocumentRef.РеестрДолжников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/InformationRegisters/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРаботыСДолгом</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Enums/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРаботыСДолгом</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Приостановлена</name>
  </enumValues>
  <enumValues>
    <name>Остановлена</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
</mdclass:Enum>

DebtManagment/src/Documents/СменаСтатусаРаботыСДолгами/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	// Вставить содержимое обработчика. 
    ЗаполнитьСтатусыДолговПоОтбору();
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)  
	Если Объект.Долги.Количество()>0 тогда
		ОповещениеВопрос = Новый ОписаниеОповещения("ПослеОтветаЗаполнить",ЭтотОбъект);
		ПоказатьВопрос(ОповещениеВопрос,"Табличная часть будет перезаполнена?",РежимДиалогаВопрос.ДаНет);
	иначе
	ЗаполнитьНаСервере();	
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеОтветаЗаполнить(Результат, Параметры) Экспорт // 	
	Если Результат = КодВозвратаДиалога.Да Тогда
			ЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры
	



&НаСервере
Процедура ЗаполнитьСтатусыДолговПоОтбору() 
	
	Если Не ЗначениеЗаполнено(Объект.НовыйСтатусРаботыСДолгом) тогда
		Объект.НовыйСтатусРаботыСДолгом=Перечисления.СтатусыРаботыСДолгом.Приостановлена;
	КонецЕсли; 
	   МассивДоговоров=НОвый Массив;
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) тогда 	
		МассивДоговоров.Добавить(Объект.ДоговорКонтрагента);		
	иначеесли  ЗначениеЗаполнено(Объект.Контрагент) тогда
		МассивДоговоров=ПолучитьМассивДоговоровКонтрагента(Объект.Контрагент);		
	КонецЕсли;	
	ДопУсловиеОтбора="";
	Если МассивДоговоров.Количество()>0 тогда
		ДопУсловиеОтбора=" Долг.ДоговорКонтрагента в(&МассивДоговоров)"
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Объект.Реестр) тогда 
		Если ДопУсловиеОтбора<>"" тогда
			ДопУсловиеОтбора=ДопУсловиеОтбора+" И ";			
		КонецЕсли;
		ДопУсловиеОтбора=ДопУсловиеОтбора+"Реестр = &Реестр "
	КонецЕсли;
	
		Если ЗначениеЗаполнено(Объект.Долг) тогда 
		Если ДопУсловиеОтбора<>"" тогда
			ДопУсловиеОтбора=ДопУсловиеОтбора+" И ";			
		КонецЕсли;
		ДопУсловиеОтбора=ДопУсловиеОтбора+"Долг = &Долг "
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыРаботыСДолгомСрезПоследних.Долг КАК Долг,
	|	СтатусыРаботыСДолгомСрезПоследних.Реестр КАК Реестр,
	|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом,
	|	&НовыйСтатусРаботыСДолгом КАК НовыйСтатусРаботыСДолгом
	|ИЗ
	|	РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(&НаДату, "+ДопУсловиеОтбора+") КАК СтатусыРаботыСДолгомСрезПоследних";
	
	Запрос.УстановитьПараметр("НовыйСтатусРаботыСДолгом", Объект.НовыйСтатусРаботыСДолгом);
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Запрос.УстановитьПараметр("Реестр", Объект.Реестр);
	Запрос.УстановитьПараметр("Долг", Объект.Долг);

	Запрос.УстановитьПараметр("НаДату", Объект.Дата-1);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Долги.Загрузить(РезультатЗапроса);	

КонецПроцедуры	   


&НаСервере
Функция  ПолучитьМассивДоговоровКонтрагента(Контрагент)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.СтатусДействия <>  ЗНАЧЕНИЕ(Перечисление.СтатусыРаботыСДолгом.Завершена)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат РезультатЗапроса;
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика 
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда 
		Если Параметры.Свойство("ЗаполнитьПриОткрытии") тогда
			ЗаполнитьЗначенияСвойств(Объект,Параметры);  
			Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) тогда
				Объект.Контрагент=Объект.ДоговорКонтрагента.Владелец;
			КонецЕсли;
			
			ЗаполнитьСтатусыДолговПоОтбору(); 
		КонецЕсли;
	иначе//	
	// Заполнить колонку старый статус //ОПТИМИЗИРОВАТЬ
		Для Каждого ст из Объект.Долги цикл
			ст.СтатусРаботыСДолгом  =ПолучитьСтатусРаботыСДолгом(ст.Долг,ст.Реестр, Объект.Дата-1)	
		КонецЦикла;	
	КонецЕсли;
	
	КонецПроцедуры
	
	&НаСервере
	Функция ПолучитьСтатусРаботыСДолгом(Долг,Реестр, НаДату)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтатусыРаботыСДолгомСрезПоследних.СтатусРаботыСДолгом КАК СтатусРаботыСДолгом
		|ИЗ
		|	РегистрСведений.СтатусыРаботыСДолгом.СрезПоследних(
		|			&НаДату,
		|			Долг = &Долг
		|				И Реестр = &Реестр) КАК СтатусыРаботыСДолгомСрезПоследних";
	
	Запрос.УстановитьПараметр("Долг", Долг);
	Запрос.УстановитьПараметр("НаДату", НаДату);
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	Возврат  РезультатЗапроса.СтатусРаботыСДолгом;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА	
	КонецФункции
